app/views/user_mailer/role_change_email.html.erb

SELECT `roles`.* FROM `roles` INNER JOIN `users_roles` ON `roles`.`id` = `users_roles`.`role_id` WHERE `users_roles`.`user_id` = 2
---
<p>
  Your role was changed to <%= @user.roles.first.name %>,
  your username is: <%= @user.name %>.<br/>