app/views/comments/_form.html.haml

SELECT `statuses`.* FROM `statuses`
---
      %label{:for => "status_id"} Change Status Ticket:
      = select_tag 'status_id',options_from_collection_for_select(Status.all, 'id', 'name', :selected => @answer.status_id)