app/views/users/index.html.haml

SELECT `roles`.* FROM `roles` INNER JOIN `users_roles` ON `roles`.`id` = `users_roles`.`role_id` WHERE `users_roles`.`user_id` = 1 LIMIT 1
---
          %td= user.created_at.to_date
          %td= select_tag 'state', options_from_collection_for_select(Role.all, 'id', 'name', :selected => user.roles.first.id),:include_blank => (user.roles.first.nil? ?  true : false)