app/views/tickets/index.html.haml

SELECT `statuses`.* FROM `statuses`
---
%ul
  -Status.all.each do |status|

SELECT COUNT(*) FROM `user_requests` WHERE `user_requests`.`status_id` = 1
SELECT `user_requests`.* FROM `user_requests` WHERE `user_requests`.`status_id` IS NULL
---
      =link_to status.name, '/tickets/'+status.link
-if @status.user_requests.empty?