app/controllers/answer_controller.rb

SELECT `user_requests`.* FROM `user_requests` WHERE `user_requests`.`code` = '1f6d356f969188ae5602655ba61fd974' LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`userRequest_id` = 1
---
  def index
    @answer = UserRequest.find_by_code(params[:page])
    if @answer.nil?
      redirect_to "/404.html"
    end
    @comments = Comment.find_all_by_userRequest_id(@answer.id)