app/controllers/statuses_controller.rb

SELECT `statuses`.* FROM `statuses` WHERE `statuses`.`id` = 5 LIMIT 1
DELETE FROM `statuses` WHERE `statuses`.`id` = 5
---
  def delete
    authorize! :delete, :statuses, :message => 'Access denied.'
    status = Status.find(params[:id])
    if status.link != 'close' and status.link != 'new'
      status.destroy

INSERT INTO `statuses` (`created_at`, `link`, `name`, `updated_at`) VALUES ('2013-08-15 13:19:05', '234', '324', '2013-08-15 13:19:05')
---
  def create
    authorize! :create, :statuses, :message => 'Access denied.'
    status = Status.new(:name => params[:name], :link => params[:link])
    status.save