app/controllers/statuses_controller.rb

SELECT `statuses`.* FROM `statuses`
---
  def index
    @statuses=Status.all

SELECT `statuses`.* FROM `statuses` WHERE `statuses`.`id` = 1 LIMIT 1
UPDATE `statuses` SET `link` = 'new', `name` = 'Waiting for Staff Response', `updated_at` = '2013-05-12 18:05:00' WHERE `statuses`.`id` = 1
---
  def changeStatus
    status= Status.find(params[:id])
    status.link=params[:link]
    status.name=params[:name]
    status.save

SELECT `statuses`.* FROM `statuses` WHERE `statuses`.`id` = 5 LIMIT 1
DELETE FROM `statuses` WHERE `statuses`.`id` = 5
---
  def deleteStatus
    status= Status.find(params[:id])
    status.destroy

INSERT INTO `statuses` (`created_at`, `link`, `name`, `updated_at`) VALUES ('2013-05-12 18:53:40', 'xd', 'XD', '2013-05-12 18:53:40')
---
  def createStatus
    status=Status.new(:name => params[:name], :link => params[:link])
    status.save