app/controllers/tickets_controller.rb

SELECT `statuses`.* FROM `statuses` WHERE `statuses`.`link` = 'new' LIMIT 1
---
  def index
    if params[:page] == nil
      params[:page] = Status.all.first.link