app/controllers/tickets_controller.rb

SELECT `statuses`.* FROM `statuses` WHERE `statuses`.`link` = 'tickets' LIMIT 1
SELECT `user_requests`.* FROM `user_requests` WHERE `user_requests`.`status_id` IS NULL
---
  def show
    @status=Status.find_by_link(params[:page])
    if @status==nil
      return redirect_to "/404.html"
    end
    @tickets=UserRequest.find_all_by_status_id(@status)