app/controllers/users_controller.rb

  def index
    authorize! :index, @user, :message => 'Not authorized as an administrator.'
    @users = User.all
---
SELECT `users`.* FROM `users`

  def changeRole
    user = User.find(params[:user_id])
    roles = [Role.find(params[:role_id])]
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 3 LIMIT 1