app/controllers/user_requests_controller.rb

  def create
    user_request=UserRequest.new
    user_request.attributes = params[:user_request]
    user_request.status_id=Status.find_by_link('new').id
    user_request.code=Digest::MD5.hexdigest(Time.now.to_s+user_request.email)
    if user_request.save!
---
SELECT `statuses`.* FROM `statuses` WHERE `statuses`.`link` = 'new' LIMIT 1
INSERT INTO `user_requests` (`code`, `created_at`, `email`, `name`, `status_id`, `text`, `theme`, `updated_at`) VALUES ('1f6d356f969188ae5602655ba61fd974', '2013-08-15 13:12:53', 'lesha0-lesha0@mail.ru', '123', 1, '555555', '44444', '2013-08-15 13:12:53')